/* Написать программу, которая из имеющегося массива строк формирует 
массив из строк, длинна которых меньше либо равна 3 символа. */

Console.Write("Введите позиции в массиве: "); //
string [] array=Console.ReadLine()!.Split(' ','.',',').ToArray();